[
  { 
    "year": "26", 
    "type": "PROJECT", 
    "name": "PORTFOLIO", 
    "field": ["CSEN", "WEB"], 
    "url": "https://github.com/dgne58/portfolio",
    "img": "./images/5portfolio/portfolio.png",
    "subImages": [
      "#",
      "#"
    ],
    "description": "The website you're on right now. React 19 + TypeScript, Three.js for WebGL shaders"
  },
  { 
    "year": "25", 
    "type": "HACKATHON", 
    "name": "JARVIS", 
    "field": ["CSEN", "HARDWARE"], 
    "url": "https://devpost.com/software/jarvis-0xt8ro",
    "img": "./images/4jarvis/jarvismain.jpg",
    "subImages": [
        "./images/4jarvis/jarvisalt2.png",
        "./images/4jarvis/jarvisalt3.gif"
    ],
    "description": "Winner at Calhacks 12.0, hosted by UC Berkeley. Real time AI Assistant and Heads Up Display that lives in the Meta Ray Bans 2.0. Jailbroke Meta Glasses 2 hardware and developed a custom WhatsApp livestream proxy to stream the UI directly from the backend to the glasses, for low-latency (<750 ms) response rendering. Integrated OpenCV for face recognition, Selenium for contextual data retrieval, and a dynamic overlay system for in-glass visual output. Outperformed 700+ teams (2,100 participants) to win the Most Wacky Hack Award from Wordware, recognized as the first working AI AR overlay assistant for smart glasses."
  },
  { 
    "year": "25", 
    "type": "COMPETITION", 
    "name": "BRONCO RACING AERODYNAMICS + CHASSIS", 
    "field": ["MECH", "AERO"], 
    "url": "https://bronco-racing.com/",
    "img": "./images/3br/brmain.png",
    "subImages": [
      "./images/3br/bralt.png",
      "./images/3br/bralt2.jpg"
    ],
    "description": "Designed and analyzed the Formula SAE braking system and front wing structure using SolidWorks and ANSYS FEA, optimizing strength to-weight ratios under competition constraints. Modeled composite layups and aluminum mounts for the front wing assembly to minimize drag and maximize downforce balance at 60+mph. Ensured precise integration between chassis, braking, and aerodynamic subsystems within a ±0.5 mm compliance tolerance. Worked closely on manufacturing for jig fabrication, tube cutting, and MIG welding, gaining hands-on experience with machining"
  },
  { 
    "year": "25", 
    "type": "HACKATHON", 
    "name": "CINEFLOW", 
    "field": ["CSEN", "WEB"], 
    "url": "https://devpost.com/software/cineflow",
    "img": "./images/2cineflow/cineflowmain.png",
    "subImages": [
      "./images/2cineflow/cineflowalt2.png",
      "./images/2cineflow/cineflowalt.gif"
    ],
    "description": "Adobe Creative Cloud add-on that generates seamless AI-powered cinematic transitions between video clips. Built end-to-end system in under 22 hours using React, Vite, TailwindCSS, Radix UI, TensorFlow, and Keras. Outperformed 78 participants, winning 1st Place Overall based on technical innovation, usability, and design."
  },
  { 
    "year": "23", 
    "type": "PROJECT", 
    "name": "ToddEd", 
    "field": ["CSEN", "WEB"], 
    "url": "https://youtu.be/ZWxDFH1nG0U",
    "img": "./images/1todded/toddedmain.png",
    "subImages": [
      "./images/1todded/toddedalt.jpg",
      "#"
    ],
    "description": "Trained a GPT-2 Neo model on TED Talk data, enabling automated TED Talk script generation on any topic. Deployed the AI on Hugging Face with a custom frontend, generating 1,500+ site visits in two weeks."
  },
  { 
    "year": "21", 
    "type": "HACKATHON", 
    "name": "STELLAR", 
    "field": ["CSEN", "WEB"], 
    "url": "#",
    "img": "./images/0stellar/stellarmain.png",
    "subImages": [
      "#",
      "./images/0stellar/stellaralt.png"
    ],
    "description": "Awarded Best Mobile Application on the 2021 LHS Hackathon. Stellar is an app that gives you real time information about what’s going on in space. Developed in Snack Expo using React Native."
  }
]